##############################################
# 순서별로 정렬 
arr = [(1,2),(2,3),(3,1)]
# 1번째를 기준으로 정렬 
arr = sorted(arr, key = lambda x : x[1])
print(arr)
##############################################
# 큐 :
from collections import deque
##############################################
# 조합, 순열 
from itertools import combinations
from itertools import permutations
##############################################
# dict은 그냥 쓰면 된다.
##############################################
# 브루트 포스의 종류 
# 1. for문 
# 2. 재귀함수를 이용 
##############################################
# bfs (큐) : 최소거리인 경우에는 큐를 사용한다.
##############################################
# 다익스트라.
# 1. 우선순위 큐 
# 2. 그래프 







